{"config": [{"config": {"arguments": {}, "output_shape_type": "raw", "function_type": "lambda", "trainable": true, "name": "lambda_6", "dtype": "float32", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa <ipython-input-100-82d1b46baaf0>\u00da\b<lambda>\u0006\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 30, 90, 3]}, "class_name": "Lambda"}, {"config": {"data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "name": "conv2d_16", "kernel_constraint": null, "filters": 32, "use_bias": true, "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_16", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "name": "conv2d_17", "kernel_constraint": null, "filters": 64, "use_bias": true, "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_17", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "name": "conv2d_18", "kernel_constraint": null, "filters": 128, "use_bias": true, "bias_constraint": null, "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_18", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_6", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "dense_21", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 500, "bias_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_16", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "dense_22", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 100, "bias_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_17", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "dense_23", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 10, "bias_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_18", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "dense_24", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 1, "bias_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.0", "backend": "tensorflow"}